# ТЕТРИС ВОЙНИ:


# Какво ще включва:
#     - Класическият геймплей от 80те
#     - Ако остане време - multiplayer mode (като на TetrisFriends)


# Тук има нахвърляни разни идеи:
# https://github.com/m1trix/Tetris-Wars


# Понеже в конзолата трудно ще направя key event-и,
# ще направя едно GUI (с Python-ския SDL). Няма да е нищо
# впечатляващо - шарени квадратчета


# Следваща стъпка - удобства:
#     - Гравитация - когато се счупи даден ред, тетриминотата
# могат да "пропаднат" надолу, ако има кухини.
#     - Hold на падащото тетримино - при натискане на бутона
# за задържане, текущото и задържаното си разменят местата.
# Дава гъвкавост
#     - Опашка на предстоящите 4-5 тетриминотата
#     - Easy spin - Когато тетриминото удари в купчинката,
# то не се "фиксира" веднага, а има още известно време,
# в което може да бъде завъртяно. Когато се завърти, това
# време се възстановява, но разбира се, само краен брой пъти.


# Следваща стъпка - multiplay:
# Това е, само ако ми остане време. Не обещавам нищо!
#     - Multiplayer mode, в който двама играчи, играят
# един срещу друг през интернет. Редовете, които единият
# маха, отиват при другия, като изникват отдолу на игралното поле.
#     - Минички - "изпратените" редове имат по една
# миничка (на произволно място). Ако тя бъде ударена,
# целият ред се маха и се "изпраща" на другят играч.
# Комботата - дълги поредици от взривени мини, постепенно
# # увеличават броя на изпращаните редове.
#     - Нокаути - Когато игралното поле се напълни с редове,
# и няма как да падат нови тетриминота, играчът бива нокаутиран.
# Тогава полето му се изчиства изцяло. Печели играчът, който е
# нокаутирал съперника си повече пъти.
#     - Ако нокаутите са равен брой, победата се определя от броя
# изпратени редове. Отново, човекът с повече печели.
#     - Ако и те се равни, тогава, този с по-ниска купчинка печели.